emacs/configs/05-completion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Completion System</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">Completion System</h1>
<p>
Built-in completion using Emacs native functionality. No external packages required.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">completion-conf.el --- Built-in Completion  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Uses only Emacs built-in completion functionality.
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">- icomplete-vertical-mode for minibuffer completion UI
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">- flex completion style for fuzzy matching
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">- completions-detailed for annotations
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">- recentf for recent files
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">- savehist for completion history
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Minibuffer Completion UI
</span>(<span class="org-keyword">use-package</span> icomplete
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:init</span>
  (icomplete-vertical-mode 1)
  <span class="org-builtin">:custom</span>
  (icomplete-delay-completions-threshold 0)
  (icomplete-compute-delay 0)
  (icomplete-show-matches-on-no-input t)
  (icomplete-scroll t)
  (icomplete-prospects-height 10)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> icomplete-minibuffer-map
         (<span class="org-string">"RET"</span> . icomplete-force-complete-and-exit)
         (<span class="org-string">"TAB"</span> . icomplete-force-complete)
         (<span class="org-string">"C-n"</span> . icomplete-forward-completions)
         (<span class="org-string">"C-p"</span> . icomplete-backward-completions)))

<span class="org-comment-delimiter">;;; </span><span class="org-comment">Completion Styles
</span>(<span class="org-keyword">use-package</span> minibuffer
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:custom</span>
  (completion-styles '(flex basic partial-completion emacs22))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-ignore-case t)
  (read-buffer-completion-ignore-case t)
  (read-file-name-completion-ignore-case t)
  (completions-detailed t)
  (completions-format 'one-column)
  (completions-max-height 20))

<span class="org-comment-delimiter">;;; </span><span class="org-comment">Recent Files
</span>(<span class="org-keyword">use-package</span> recentf
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:init</span>
  (recentf-mode 1)
  <span class="org-builtin">:custom</span>
  (recentf-max-saved-items 100)
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-x C-r"</span> . recentf-open-files))

<span class="org-comment-delimiter">;;; </span><span class="org-comment">Completion History
</span>(<span class="org-keyword">use-package</span> savehist
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:init</span>
  (savehist-mode 1))

<span class="org-comment-delimiter">;;; </span><span class="org-comment">Keybindings for built-in commands
</span>(global-set-key (kbd <span class="org-string">"M-g i"</span>) 'imenu)
(global-set-key (kbd <span class="org-string">"C-c s l"</span>) 'occur)
(global-set-key (kbd <span class="org-string">"C-c s g"</span>) 'grep)

(<span class="org-keyword">provide</span> '<span class="org-constant">completion-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">completion-conf.el ends here</span>
</pre>
</div>
</main>
</body>
</html>
